Autodesk.Revit.DB.TemporaryViewModes.IsValidState(Autodesk.Revit.DB.PreviewFamilyVisibilityMode)
Tests whether the given state is valid for the associated view and the context the view is currently in.
Remarks:
As long as the PreviewFamilyVisibility mode is available and enabled in the associated view,
the Off and On states are always valid. However, the Uncut state is only
valid in plan views and reflected ceilings.
state:
A state of the PreviewFamilyVisibilityMode
Returns:
Returns True if the state is applicable for the view; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.IsModeEnabled(Autodesk.Revit.DB.TemporaryViewMode)
Tests whether a temporary view mode is currently enabled in the associated view.
Remarks:
Most of temporary modes are enabled in a specific context only.
A programmer who wants to use a mode needs to first test whether
it is currently available and enabled, or not.
mode:
The mode to evaluate
Returns:
True if the requested mode is available and enabled in the associated view; False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.IsModeAvailable(Autodesk.Revit.DB.TemporaryViewMode)
Tests whether a temporary view mode is currently available in the associated view.
Remarks:
Not every mode is available in all views at all times.
Some of the modes are only available in certain views,
or only at certain time/context. Modes that are not available
will not be visible on the view's tool bar in the UI.
Even modes that are available do not have to be currently
enabled in the current context. Before using a mode its
applicability should be tested by calling
Autodesk.Revit.DB.TemporaryViewModes.IsModeEnabled(Autodesk.Revit.DB.TemporaryViewMode).
mode:
The mode to evaluate
Returns:
True of the temporary mode is currently available in the associated view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.DeactivateAllModes
Deactivates all temporary modes that are currently active.
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.DeactivateMode(Autodesk.Revit.DB.TemporaryViewMode)
Deactivates the given temporary mode.
Remarks:
The method has no effect on modes that are already deactivated.
mode:
The mode to deactivate
Throws Autodesk.Revit.Exceptions.ArgumentException:
The temporary mode is not available in the associated view.
The view is either of a type that does not support this mode,
or is currently in a context that makes the mode presently inapplicable.
-or-
The temporary mode is presently not enabled in the associated view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.IsModeActive(Autodesk.Revit.DB.TemporaryViewMode)
Tests whether a given mode is currently active or not.
mode:
The mode being tested
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.GetCaption(Autodesk.Revit.DB.TemporaryViewMode)
A text caption to use for the given mode.
Remarks:
The text appears in the UI on the temporary frame when the view is in the temporary mode.
mode:
The mode to get a caption for.
Returns:
Text of the caption. The text is localized.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TemporaryViewModes.RevealHiddenElements
The current state of the RevealHiddenElements mode in the associated view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RevealHiddenElements mode is either disabled or inapplicable in the associated view.
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.WorksharingDisplay
The current state of the WorksharingDisplay mode in the associated view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The WorksharingDisplay mode is either disabled or inapplicable in the associated view.
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.RevealConstraints
The current state of the RevealConstraints mode in the associated view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The RevealConstraints mode is either disabled or inapplicable in the associated view.
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibilityDefaultUncutState
Controls the default type of the On state of the PreviewFamilyVisibility mode in cut-able views.
Remarks:
Newly opened views which can have both Cut and Uncut preview will use
this default cut/uncut state as long as the default On state is set to True.
To control the default state of the PreviewFamilyVisibility in all views refer to
the Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibilityDefaultOnState
property.
The settings is applicable to the whole application rather than to
individual family documents; the value persists between Revit sessions.
Although the value is allowed to be set at any time, any changes made after
the Revit application has been initialized will not have effect until the next
session of Revit.
After a view is opened with the default family preview state applied,
its PreviewFamilyVisibility mode may be independently modified through the
Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibility property. Once explicitly modified,
the settings stays in effect for the respective view even after the view
is closed and later reopened again.
A Boolean value to control whether to use a non-cut preview
in applicable views, such as floor and ceiling plan views.
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibilityDefaultOnState
Controls the default state of the PreviewFamilyVisibility mode in all views.
Remarks:
This flag controls whether each newly opened view is to have the
PreviewFamilyVisibility mode turned On by default or not. This property is applicable to all
types of views. Views that support both Cut and Non-cut preview (such as floor plans) can be
controlled further via the Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibilityDefaultUncutState
property.
The settings is applicable to the whole application rather than to
individual family documents; the value persists between Revit sessions.
Although the value is allowed to be set at any time, any changes made after
the Revit application has been initialized will not have effect until the next
session of Revit.
After a view is opened with the default family preview state applied,
its PreviewFamilyVisibility mode may be independently modified through the
Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibility property. Once explicitly modified,
the settings stays in effect for the respective view even after the view
is closed and later reopened again.
A boolean value to control whether the PreviewFamilyVisibility mode
is to be turned On or Off in all views newly opened in a family editor.
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibility
The current state of the PreviewFamilyVisibility mode in the associated view.
Remarks:
The state of the PreviewFamilyVisibility mode can be set only if the mode
is currently available and enabled in the view. Even in such a condition,
however, not all states are valid in all views. To ensure that the state
to be applied is valid in the view, call the Autodesk.Revit.DB.TemporaryViewModes.IsValidState(Autodesk.Revit.DB.PreviewFamilyVisibilityMode) method
first.
Even views which generally support temporary modes will have this particular
mode available only when the document of the view is in the environment of the
family editor.
This property affect only the view associated with this instance of TemporaryViewModes.
When a view is opened for the first time, its state of the PreviewFamilyVisibility mode
is determined based on the default settings which is controlled through the properties
Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibilityDefaultOnState and
Autodesk.Revit.DB.TemporaryViewModes.PreviewFamilyVisibilityDefaultUncutState.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given PreviewFamilyVisibilityMode is not applicable in the associated view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The PreviewFamilyVisibility mode is either disabled or inapplicable in the associated view.
Since:
2016 Subscription Update

Autodesk.Revit.DB.TemporaryViewModes
A data structure containing data related to temporary view modes.
Remarks:
The class contains methods and properties to manipulate states
of various temporary view modes that may or may not be avilable
in any of visible views of a Revit document. The temporary modes are
enumerated in the Autodesk.Revit.DB.TemporaryViewMode
class.
Every view that supports temporary view modes owns an instance
of this TemporaryViewModes class, which can be obtained by
accessing the Autodesk.Revit.DB.View.TemporaryViewModes
property of the Autodesk.Revit.DB.View class.
Note that views which do not support temporary modes will have that
property's value be Null.
Since:
2016 Subscription Update